import { QuestionsDB } from "./types";

export const DEFAULT_QUESTIONS_DB: QuestionsDB = {
  blitz: [
    { "id": 1, "question": "Ладошки: сыграйте в ладошки с любым игроком. Кто быстрее хлопнет по рукам другого?" },
    { "id": 2, "question": "Гляделки: выберите противника и смотрите друг другу в глаза не мигая. Кто первый моргнет тот проиграл!" },
    { "id": 3, "question": "Камень-ножницы-бумага: сыграйте с соседом справа до 3-х побед." },
    { "id": 4, "question": "Загадай число: загадайте число от 1 до 10. Сосед слева должен угадать его за 3 попытки." },
    { "id": 5, "question": "Расскажи забавный факт или шутку о себе за 15 секунд." },
    { "id": 6, "question": "Назови 5 столиц европейских стран за 10 секунд!" },
    { "id": 7, "question": "Попробуй произнеси скороговорку: «Шла Саша по шоссе и сосала сушку» 3 раза без ошибок!" },
    { "id": 8, "question": "Кто последний из игроков поднимет руку вверх, тот проигрывает Блиц!" },
    { "id": 9, "question": "Назови 5 предметов желтого цвета в этой комнате за 5 секунд!" },
    { "id": 10, "question": "Назови 3 мема этого года за 10 секунд!" }
  ],
  question: [
    { "id": 1, "question": "Какая планета Солнечной системы является самой горячей? (Ответ: Венера)" },
    { "id": 2, "question": "Какой химический элемент обозначается символом 'Au'? (Ответ: Золото)" },
    { "id": 3, "question": "Как называется самый большой океан на планете Земля? (Ответ: Тихий)" },
    { "id": 4, "question": "В каком году произошел первый полет человека в космос? (Ответ: 1961)" },
    { "id": 5, "question": "Сколько зубов у взрослого человека в норме? (Ответ: 32)" },
    { "id": 6, "question": "Какая птица способна летать задом наперед? (Ответ: Колибри)" },
    { "id": 7, "question": "Какой металл является жидким при комнатной температуре? (Ответ: Ртуть)" },
    { "id": 8, "question": "Какое млекопитающее является самым крупным на Земле? (Ответ: Синий кит)" },
    { "id": 9, "question": "Как называется столица Австралии? (Ответ: Канберра)" },
    { "id": 10, "question": "Сколько секунд в часе? (Ответ: 3600)" }
  ],
  duel: [
    { "id": 1, "question": "Русская рулетка. Из двух карт (одна красная, одна черная) выберите одну. Нашедший черную проиграл! Победитель ходит на +2, проигравший -1." },
    { "id": 2, "question": "Поменяйтесь местами: вы меняетесь фишками со своим дуэлянтом на поле прямо сейчас!" },
    { "id": 3, "question": "Говорите друг другу детские обзывалки по очереди, пока у кого-то не кончатся варианты!" },
    { "id": 4, "question": "Факты: скажите факт о себе, оппонент повторяет. Оппонент говорит свой - вы повторяете. И так по нарастающей! Кто первый собьется - проиграл." },
    { "id": 5, "question": "Кто дольше простоит на одной ноге с закрытыми глазами? На старт, внимание, марш!" },
    { "id": 6, "question": "Борьба на руках (Армрестлинг): короткий раунд армрестлинга решает исход дуэли." },
    { "id": 7, "question": "Ассоциации: называйте слова по очереди на скорость. Задержка больше 2 секунд — проигрыш!" },
    { "id": 8, "question": "Кто назовет больше марок машин за 20 секунд по очереди?" },
    { "id": 9, "question": "Цу-Е-Фа: классическая дуэль камень-ножницы-бумага на 3 раунда." },
    { "id": 10, "question": "Морской бой: назовите координаты (А1-Д5). У кого больше попаданий по скрытым клеткам?" }
  ]
};
